/*
  物品
  [ID,名称,介绍,买入价,卖出价,获得时触发的事件]
*/
var ItemSet = new Object();
ItemSet.All = [
  [0,"黄钥匙","开启黄色门",10,5,"AddKey('Yellow',1)"],
  [1,"蓝钥匙","开启蓝色门",50,25,"AddKey('Blue',1)"],
  [2,"红钥匙","开启红色门",100,50,"AddKey('Red',1)"],
  [3,"绿钥匙","开启绿色门",0,0,"AddKey('Green',1)"],
  [4,"铁门钥匙","开启铁门",0,0,"AddKey('Iron',1)"],
  [5,"普通钥匙盒","获得黄、蓝、红钥匙各一把",0,0,"AddKey('KeyHub1',1)"],
  [6,"宝石钥匙盒","获得黄、蓝、红钥匙各三把",0,0,"AddKey('KeyHub1',1)"],
  [7,"红宝石","增加 3 点攻击",0,0,"AddATK(3)"],
  [8,"蓝宝石","增加 3 点防御",0,0,"AddDEF(3)"],
  [9,"怒气宝石","增加 1% 暴击率",0,0,"AddCTR(1)"],
  [10,"敏捷宝石","增加 1% 闪避率",0,0,"AddEXD(1)"],
  [11,"小血瓶","增加 200 点生命",0,0,"AddHP(200)"],
  [12,"大血瓶","增加 500 点生命",0,0,"AddHP(500)"],
  [13,"经验药水","增加300点经验",0,0,"AddExp(300)"],
  [14,"敏捷药水","闪避率增加10% 持续1分钟",0,0,"AddEXD(10,60000)"],
  [15,"","",0,0,""],
  [16,"","",0,0,""],
  [17,"","",0,0,""],
  [18,"","",0,0,""],
  [19,"","",0,0,""],
  [20,"圣水","生命值翻倍",0,0,"AddHolyWater()"],
  [21,"铁剑","增加 10 点攻击",0,0,"AddATK(10)"],
  [22,"银剑","增加 30 点攻击",0,0,"AddATK(30)"],
  [23,"骑士剑","增加 50 点攻击",0,0,"AddATK(50)"],
  [24,"圣剑","增加 100 点攻击",0,0,"AddATK(100)"],
  [25,"幸运金币","获得 300 金币",0,0,"AddGold(300)"],
  [26,"铁盾","增加10点防御",0,0,"AddDEF(10)"],
  [27,"银盾","增加30点防御",0,0,"AddDEF(30)"],
  [28,"骑士盾","增加 50 点防御",0,0,"AddDEF(50)"],
  [29,"圣盾","增加 80 点防御",0,0,"AddDEF(80)"],
  [30,"神圣剑","增加220点攻击",0,0,"AddATK(220)"],
  [31,"神圣盾","增加220点防御",0,0,"AddDEF(220)"],
  ["A1","怪物图鉴","获得怪物图鉴，使用它你将能够看到当前楼层所有怪物的信息和它们对你造成的伤害，已加入你的工具栏中，按“E”键或者点击左下方工具栏中对应的图标开启",0,0,"AddEnemyBook()"],
  ["A2","奇怪的权杖","获得奇怪的权杖，它似乎拥有让你在所在楼层跳跃到其它已到达的楼层中的能力，已经加入你的工具栏中，按“F”键或者点击左下方工具栏中对应的图标开启",0,0,"AddGoFloor()"],
  ["A4","下楼器","获得下楼器，它拥有将你送往当前楼层下一层的能力，无楼梯能够到达的楼层可以使用它帮助你到达该楼层，按“O”键或者点击左下方工具栏中对应的图标使用",0,0,"AddDownFloor()"],
  ["A5","破墙镐","获得破墙镐，你能够使用它摧毁你面前的一堵墙，但是有一些墙面是无法摧毁的，按“P”键或者点击左下方工具栏中对应的图标使用",0,0,"AddPickaxe()"],
  ["A6","飞羽","获得飞羽，使用它能够将你传送到与你当前位置中心对称的位置，如果该位置非地板将无法传送，按“Y”键或者点击左下方工具栏中对应的图标使用",0,0,"AddTool('Fly')"],
  ["A7","地震卷轴","获得地震卷轴，在任意楼层使用它，将能够把该层能够被摧毁的墙全部摧毁，按“Q”键或者点击左下方工具栏中对应的图标使用",0,0,"AddTool('EarthQuake')"],
  ["A8","冰冻徽章","获得冰冻徽章，面对岩浆使用它时，你周围的岩浆将被冻结为地板，按“I”键或者点击左下方工具栏中对应的图标使用",0,0,"AddIce()"],
  ["A9","随意门","获得随意门，当面前的墙允许变成黄门时使用它，该墙将变为黄门，开门仍需黄钥匙，按“G”键或者点击左下方工具栏中对应的图标使用",0,0,"AddTool('Door',1)"],
  ["A10","屠龙匕","获得屠龙匕，在与魔龙战斗时勇士攻击力加倍，此为自动道具，无需手动使用",0,0,"AddDragon()"],
  ["A11","圣水","获得圣水，使用后可使当前生命值翻倍，按“V”键或者点击左下方工具栏中对应的图标使用",0,0,"AddHolyWater()"],
  ["A12","罪恶权杖","你渴望力量吗？◣◢",0,0,'AddTool("Dark",-1)']
];
/*
  道具
  消耗道具  道具名:[IconID,中文名,介绍,快捷键,数量]
  永久道具  道具名:[IconID,中文名,介绍,快捷键,是否获得，获得为-1未获得为-2]
*/
ItemSet.Tool = {"Pickaxe":[0,"破墙镐","使用它凿开你面前可被破坏的石墙，不过它是一次性的","P",0],
"EarthQuake":[1,"地震卷轴","消除本层所有能够被毁坏的墙","Q",0],
"UpFloor":[2,"上楼器","直接传送到上一层的下楼梯口","U",0],
"DownFloor":[3,"下楼器","直接传送到下一层的上楼梯口","O",0],
"Fly":[4,"飞羽","传送到与当前位置中心对称的位置","Y",0],
"HolyWater":[5,"圣水","使当前生命值翻倍","V",0],
"Boom":[6,"炸弹","毁灭面前一个非Boss怪物","B",0],
"EnemyBook":[10,"怪物图鉴","查看当前楼层的怪物信息","E",-2],
"GoFloor1":[11,"奇怪的权杖","可传送于各楼层","F",-2],
"Ice":[8,"冰冻徽章","消除面前的岩浆为地面","I",-2],
"Crucifix":[7,"圣十字架","克制怪物无敌属性","auto",-2],
"Door":[9,"随意门","将面前可变成黄门的墙换为黄门","G",0],
"Dragon":[12,"屠龙匕","对付魔龙时攻击力加倍","auto",-2],
"Dark":[13,"罪恶权杖","你渴望力量吗？◣◢","auto",-2]
};

ItemSet.GetData = function(Type,ID){
	var Datas = eval("ItemSet." + Type);
	if(typeof(ID) != "undefined"){
	  for(var i = 0;i < Datas.length;i++){
		  if(Datas[i][0] == ID){
			  return Datas[i];
		  }
	  }
	}
	else{
	  return Datas;
	}
}